# # level 1
# # 1️⃣ Порахуй
# # Напиши програму, яка:
# # приймає число n
# # виводить суму чисел від 1 до n
# from Lessons.lesson_1.main import some_str
# #
# # n = 25
# # i = 0
# # sume = 0
# # while i < n:
# #     i += 1
# #     sume += i
# #
# # print(sume)
# # for i in range(1, n + 1):
# #     sume += i
# # # 2️⃣ Парні числа
# # # Виведи всі парні числа від 1 до 100
# # print(list(range(1, 100)))
# # # fo
# # 3️⃣ Лічильник літер
# # Користувач вводить рядок.
# # Порахуй, скільки в ньому голосних (a, e, i, o, u)
# # 4️⃣ Таблиця множення
# # Виведи таблицю множення для числа, яке вводить користувач.
# # level 2
# # 5️⃣ Дочекайся числа4
# # Цикл просить користувача ввести число більше 10.
# # Поки число ≤ 10 — цикл не завершується.
# # 6️⃣ Пароль
# # Користувач вводить пароль.
# # Правильний пароль: "python123"
# # якщо ввів неправильно — проси знову
# # якщо правильно — виведи "Access granted"
#
# ACCEPT_STRING = "python123"
#
# for i in range(5):
#     some_str = input('Enter password: ')
#     if some_str == ACCEPT_STRING:
#         print('Access granted')
#         break
#
# # while True:
# #     some_str = input('Enter password: ')
# #     if some_str == ACCEPT_STRING:
# #         print('Access granted')
# #         break
#
#
# # 7️⃣ Пропусти зайве
# # Є список чисел.
# # Виведи всі числа, крім тих, що кратні 3.
# # level 3
# # 8️⃣ Реверс
# # Є рядок.
# # Виведи його навпаки, використовуючи цикл.
# # 9️⃣ Порахуй слова
# # Порахуй, скільки слів у рядку, що починаються з великої літери.
# # 🔟 Перше входження
# # Користувач вводить рядок.
# # Знайди позицію першої цифри в рядку.
# # Якщо цифр немає — виведи "No digits".
